//###########################################################################################################
// enchant.js game engine
//
// 2013.12.28 ver0.1
//
// Coded by Kow Sakazaki
//###########################################################################################################

// environ values setting ###################################################################################
var SCREEN_WIDTH = 240;					// 画面の幅
var SCREEN_HEIGHT = 320;				// 画面の高さ
var FPS = 30;							// フレームレート
var BGCOLOR = "black";					// 背景色
var OBJECTNUM = 100;					// キャラの最大数
var IMAGELIST = ['media/chara1.png']
